---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRampError
source: html/9d07c58c-e678-7afa-73ba-8aab33cfde4f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NotALineRiserRampError Property

Riser line must be a straight line for Ramps.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotALineRiserRampError { get; }
```